{
    "name": "rti",
    "page_title": "Rayleigh-Taylor instability - investigating the most damaging phenomena in laser fusion experiments",
    "title": "Rayleigh-Taylor Instability",
    "subtitle": "Examining the physics behind the most damaging phenomena in laser fusion",
    "company_name": "",
    "tldr": "The Rayleigh-Taylor instability (RTI) is believed to be the culprit for the failure of current laser fusion experiments - it rips the fuel apart before it can burn.   I'm designing a 3D simulation to understand how it differs from 2D.",
    "skills_employed": "Hydrodynamics, convolution smoothing, time series analysis, mathematics, large dataset analysis, Linux, parallel computing, C++, Python, Cython, Matplotlib, NumPy SciPy.",
    "image": {
        "embed_html": "<div class='videoWrapper'><iframe width=605 height=537 src='https://www.youtube.com/embed/NU3zwcj_fJc'></iframe></div>",
        "caption": "Each blue circle represents the position of the blue line in the video above.  After about t>2.5, the simulation diverges from the analytic results - this is due to the inaccuracies from the grid.  The theory is not complete, it would have diverged from the simulation eventually (if I'd got the simulation behaving perfectly), but this shows at least I'm matching the test analytics."
    },
    "image_social_media_link": "http://chrisjdavie.github.io/images/rti_white_bg.png",
    "sections": [
        {
            "subsections": [
                {
                    "title": "Baseline RTI model",
                    "paragraphs": [
                        "To examine RTI I’m constructing a baseline models to work from; planar geometry is the simplest case that replicates an analytic solution. I reproduce this solution within the regime of interest, the video above shows one of the final production simulations. The image below compares the simulation growth to the theory, that of Kull.",
                        "<img class='img-fluid portfolio-image style-bust-svg' src='images/rti-baseline.svg' alt='RTI growth, simulation compared to analytics.'></img>",
                        "Each blue circle represents the position of the blue line in the video above.  After about t>2.5, the simulation diverges from the analytic results - this is due to the inaccuracies from the grid.  The theory is not complete, it would have diverged from the simulation eventually (if I'd got the simulation behaving perfectly), but this shows at least I'm matching the test analytics.",
                        "We are now extending this to spherical geometry and have reconstruct an analytic solution, as the first stage for examining IFE-relevant physics."
                    ]
                },
                {
                    "title": "Kidder solution model",
                    "paragraphs": [
                        "<iframe width='605' height='454' src='https://www.youtube.com/embed/W_zIGHNh_y4' frameborder='0' allowfullscreen></iframe>",
                        "This is a video of the Kidder solution for compression of material. The analytic RTI growth rate uses the Kidder solution, a spherical compression that involves no heating of the material. As the first stage of this 3D simulation of spherical RTI, I recreate the Kidder solution (this example is symmetric 2D)."
                    ]
                }
            ]
        }
    ],
    "footnotes": [],
    "index": {
        "image_link": "images/rti_baseline.svg",
        "tldr": "Building a platform to examine the physics behind the most damaging phenomena in laser fusion."
    },
    "created_date": "1970-01-06",
    "category": "research",
    "portfolio_link": "rti.html"
}