{
    "name": "speech-to-text",
    "page_title": "Speech-to-text pipeline - speech recognition in multiple languages",
    "title": "Speech-to-text pipeline",
    "subtitle": "Speech recognition in multiple languages",
    "company_name": "Speechmatics",
    "tldr": "I worked at a provider of automatic speech recognition (ASR), automating the building of ASR systems in multiple languages.",
    "skills_employed": "Software design, specification gathering, data pipelines, web scraping, databases, PostgreSQL, Python (scrapy, numpy, scipy), Luigi, project design, Linux",
    "image": {
        "caption": "Global language coverage, as of July 2016.",
        "embed_html": "<iframe width='900' height='500' frameborder='0' scrolling='no' src='https://plot.ly/~cjdavie/0.embed'></iframe>"
    },
    "image_social_media_link": "http://chrisjdavie.github.io/images/speech-to-text.png",
    "sections": [
        {
            "subsections": [
                {
                    "title": "Challenge",
                    "paragraphs": [
                        "Previously, there was a largely manual process for building ASR systems, using state-of-the-art deep neural net technologies. This manual process worked in English and German, with ambitions for automatically building ASR systems for many world languages. While the process for building these new languages had been proven with German, the process needed to be automated, and made robust, reproducible and scaleable to 10s of languages."
                    ]
                },
                {
                    "title": "Solution",
                    "paragraphs": [
                        "Building speech recognition systems has two parts - the language model and acoustic model. I gathered the specifications for the acoustic model pipeline, I then designed and my team built this pipeline. We then went on to redesign and reimplement the underlying machine learning libraries, based on the success of the pipeline. This design combined the machine learning technology, some reworking of the software design methods, unit and integration testing and open-source pipeline software.",
                        "I also designed the data handling system, including the databases and data ingestion. This allowed rapid storing and processing of many thousands of hours of audio data, in many languages from a range of sources - both internal and external.",
                        "The design principles and technologies allowed a robust, maintainable and scalable framework for automatically building a full ASR system, from the initial data to a fully tested model, ready for deployment in the cloud."
                    ]
                },
                {
                    "title": "Results",
                    "paragraphs": [
                        "This pipeline successfully built ASR systems for over 20 languages last year, where the goal was 10. These included French, Spanish and Japanese. The previous manual language building process took many weeks of work, spread over months. This automated pipeline typically takes less than a day of work in total, with the build itself taking a few weeks."
                    ]
                }
            ],
            "title": "Speech recognition in many languages",
            "paragraphs": [
                "Speechmatics provides cloud-based speech recognition in multiple languages, with a per-hour pricing, and also provides on-premesis solutions."
            ]
        }
    ],
    "footnotes": [],
    "index": {
        "image_link": "images/speech-to-text.png",
        "tldr": "Automating the building of speech-to-text systems in multiple languages, for a provider of automatic speech recognition."
    },
    "created_date": "1970-01-12",
    "category": "commercial",
    "portfolio_link": "speech-to-text.html"
}